<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
  <HEAD>
    <TITLE>
      CONCLUSION
    </TITLE>
    <style>
      body {
        font-family: Tahoma, sans-serif;
        margin: 30px;
      }
      .button {
        display: inline-block;
        padding: 10px 30px;
        font-size: 20px;
        border: none;
        border-radius: 5px;
        background-color: #09805cc0;
        color: #fff;
        cursor: pointer;
        margin: 10px;
        text-decoration: none;
      }

      .button:hover {
        background-color: #13af2d;
      }
    </style>
    <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=ISO-8859-1">
    <META HTTP-EQUIV="Expires" CONTENT="0"> 
  </HEAD>
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.3/css/all.min.css">
   
  <BODY BACKGROUND="imagenes/fondo.png" TEXT="#000000" LINK="#33FFFF" VLINK="#FF9900" ALINK="#33CC00">
      <div class="container">
        <a href="index.html" class="button" title="Inicio">
          <i class="fas fa-home"></i>
        </a> 
        <CENTER>
          <H1>CONCLUSI&Oacute;N</H1> 

            <H3>Como modelo de validaci&oacute;n de documentos XML, las DTD (Document Type Definitions) ofrecen una amplia gama de funciones y posibilidades 
              para definir estructuras de documentos y validar su conformidad con las reglas espec&iacute;ficas. Una de sus ventajas es su simplicidad y 
              flexibilidad, lo que las hace adecuadas para documentos sencillos o complejos, y su capacidad para establecer restricciones y reglas para 
              cada elemento y atributo del documento. Las DTD vistas en la presente gu&iacute;a pueden ser internas o externas. Las DTD internas son una forma 
              eficaz de definir la estructura y los requisitos de contenido de un documento XML. A diferencia de las DTD externas, no requieren un 
              archivo separado y pueden agregarse directamente al documento XML, tambi&eacute;n las DTD internas son &uacute;tiles cuando el XML es relativamente 
              simple y no se espera que cambie con frecuencia. Sin embargo, las DTD internas pueden generar un c&oacute;digo XML m&aacute;s largo y m&aacute;s dif&iacute;cil de 
              leer debido a la inclusi&oacute;n junto a la definici&oacute;n del documento XML.<BR><BR><BR>

              En cuanto a las DTD externas permiten reutilizarlas en m&uacute;ltiples documentos y facilitan el mantenimiento y actualizaci&oacute;n de la estructura 
              del documento. Adem&aacute;s, al separar la DTD del documento, se simplifica la tarea de editar y gestionar el contenido. El uso de un DTD externo 
              permite asegurarse de que todos los documentos XML que sigan esa estructura cumplan las mismas reglas de validaci&oacute;n y definiciones, lo que 
              garantiza una coherencia en la informaci&oacute;n o en los datos de los archivos involucrados.<BR><BR><BR>

              La elecci&oacute;n de utilizar un DTD interno o externo depender&aacute; del prop&oacute;sito del documento XML, si se trata de un documento &uacute;nico, 
              sin necesidad de ser referenciado por otros documentos, puede ser conveniente utilizar un DTD interno, sin embargo, si se trata 
              de un conjunto de documentos que siguen la misma estructura, el uso de un DTD externo puede ser m&aacute;s pr&aacute;ctico y eficiente para 
              manejar diferentes tipos de datos.
            </H3>
            <BR>  
        </CENTER>
  </div>
  </BODY>
</HTML>